JaeheeKwon/nuttx/arch/arm/src/stm32h5/hardware/stm32h5x3xx_rcc.h
#define RCC_CFGR2_PPRE1_SHIFT         (4)  /* Bits 4-6: APB1 prescaler */
#define RCC_CFGR2_PPRE1_MASK          (7 << RCC_CFGR2_PPRE1_SHIFT)
#  define RCC_CFGR2_PPRE1_HCLK        (0 << RCC_CFGR2_PPRE1_SHIFT)
#  define RCC_CFGR2_PPRE1_HCLKd2      (4 << RCC_CFGR2_PPRE1_SHIFT)
#  define RCC_CFGR2_PPRE1_HCLKd4      (5 << RCC_CFGR2_PPRE1_SHIFT)
#  define RCC_CFGR2_PPRE1_HCLKd8      (6 << RCC_CFGR2_PPRE1_SHIFT)
#  define RCC_CFGR2_PPRE1_HCLKd16     (7 << RCC_CFGR2_PPRE1_SHIFT)
                                             /* Bit 7: Reserved */

#define RCC_CFGR2_PPRE2_SHIFT         (8)  /* Bits 8-10: APB2 Core prescaler */
#define RCC_CFGR2_PPRE2_MASK          (7 << RCC_CFGR2_PPRE2_SHIFT)
#  define RCC_CFGR2_PPRE2_HCLK        (0 << RCC_CFGR2_PPRE2_SHIFT)
#  define RCC_CFGR2_PPRE2_HCLKd2      (4 << RCC_CFGR2_PPRE2_SHIFT)
#  define RCC_CFGR2_PPRE2_HCLKd4      (5 << RCC_CFGR2_PPRE2_SHIFT)
#  define RCC_CFGR2_PPRE2_HCLKd8      (6 << RCC_CFGR2_PPRE2_SHIFT)
#  define RCC_CFGR2_PPRE2_HCLKd16     (7 << RCC_CFGR2_PPRE2_SHIFT)

#define RCC_CFGR2_PPRE3_SHIFT         (12)  /* Bits 12-14: APB3 Core prescaler */
#define RCC_CFGR2_PPRE3_MASK          (7 << RCC_CFGR2_PPRE3_SHIFT)
#  define RCC_CFGR2_PPRE3_HCLK        (0 << RCC_CFGR2_PPRE3_SHIFT)
#  define RCC_CFGR2_PPRE3_HCLKd2      (4 << RCC_CFGR2_PPRE3_SHIFT)
#  define RCC_CFGR2_PPRE3_HCLKd4      (5 << RCC_CFGR2_PPRE3_SHIFT)
#  define RCC_CFGR2_PPRE3_HCLKd8      (6 << RCC_CFGR2_PPRE3_SHIFT)
#  define RCC_CFGR2_PPRE3_HCLKd16     (7 << RCC_CFGR2_PPRE3_SHIFT)

#define RCC_CFGR2_AHB1DIS             (1 << 16)  /* Bits 16: AHB1 Disable */
#define RCC_CFGR2_AHB2DIS             (1 << 17)  /* Bits 17: AHB2 Disable */
#define RCC_CFGR2_AHB4DIS             (1 << 19)  /* Bits 19: AHB4 Disable */

#define RCC_CFGR2_APB1DIS             (1 << 20)  /* Bits 20: APB1 Disable */
#define RCC_CFGR2_APB2DIS             (1 << 21)  /* Bits 21: APB2 Disable */
#define RCC_CFGR2_APB3DIS             (1 << 22)  /* Bits 22: APB3 Disable */


/*  Bit definition for RCCPLL1CFGR register */

#define RCC_PLL1CFGR_RESET               ((uint32_t)0x00070000)

#define RCC_PLL1CFGR_PLL1RC_SHIFT      (0)  /* Bit 0: */
#define RCC_PLL1CFGR_PLL1RC_MASK       (0x3 << RCC_PLL1CFGR_PLL1RC_SHIFT)
#define RCC_PLL1CFGR_PLL1RC            RCC_PLL1CFGR_PLL1RC_MASK
# define RCC_PLL1CFGR_PLL1RC_NONE      ((uint32_t)0x00000000)  /* No source clock selected */
# define RCC_PLL1CFGR_PLL1RC_HSI       ((uint32_t)0x00000001)  /* HSI source clock selected */
# define RCC_PLL1CFGR_PLL1RC_CSI       ((uint32_t)0x00000002)  /* CSI source clock selected */
# define RCC_PLL1CFGR_PLL1RC_HSE       ((uint32_t)0x00000003)  /* HSE source clock selected */

#define RCC_PLL1CFGR_PLL1RGE_SHIFT       (2ul)
#define RCC_PLL1CFGR_PLL1RGE_MASK        (0x3ul << RCC_PLL1CFGR_PLL1RGE_SHIFT)
#define RCC_PLL1CFGR_PLL1RGE             RCC_PLL1CFGR_PLL1RGE_MASK
# define RCC_PLL1CFGR_PLL1RGE_1_2_MHZ    (0x0ul << RCC_PLL1CFGR_PLL1RGE_SHIFT)  /* The PLL input clock range frequency is between 1 and 2 MHz */
# define RCC_PLL1CFGR_PLL1RGE_2_4_MHZ    (0x1ul << RCC_PLL1CFGR_PLL1RGE_SHIFT)  /* The PLL input clock range frequency is between 2 and 4 MHz */
# define RCC_PLL1CFGR_PLL1RGE_4_8_MHZ    (0x2ul << RCC_PLL1CFGR_PLL1RGE_SHIFT)  /* The PLL input clock range frequency is between 4 and 8 MHz */
# define RCC_PLL1CFGR_PLL1RGE_8_16_MHZ   (0x3ul << RCC_PLL1CFGR_PLL1RGE_SHIFT)  /* The PLL input clock range frequency is between 8 and 16 MHz */

#define RCC_PLL1CFGR_PLL1FRACEN          (1 << 4) /* Fractional latch enable */
#define RCC_PLL1CFGR_PLL1VCOSEL          (1 << 5)

#define RCC_PLL1CFGR_PLL1M_SHIFT       (8ul)
#define RCC_PLL1CFGR_PLL1M_MASK        (0x3Ful << RCC_PLL1CFGR_PLL1M_SHIFT)
#define RCC_PLL1CFGR_PLL1M             RCC_PLL1CFGR_PLL1M_MASK

#define RCC_PLL1CFGR_PLL1PEN           (1 << 16)
#define RCC_PLL1CFGR_PLL1QEN           (1 << 17)
#define RCC_PLL1CFGR_PLL1REN           (1 << 18)




/*  Bit definition for RCCPLL2CFGR register */

/* #define RCCPLL2CFGR_RESET               ((uint32_t)0x01FF0000) */

#define RCC_PLL2CFGR_PLL2SRC_SHIFT      (0)  /* Bit 0: */
#define RCC_PLL2CFGR_PLL2SRC_MASK       (0x3 << RCC_PLL2CFGR_PLL2SRC_SHIFT)
#define RCC_PLL2CFGR_PLL2SRC            RCC_PLL2CFGR_PLL2SRC_MASK
# define RCC_PLL2CFGR_PLL2SRC_NONE      ((uint32_t)0x00000000)  /* No source clock selected */
# define RCC_PLL2CFGR_PLL2SRC_HSI       ((uint32_t)0x00000001)  /* HSI source clock selected */
# define RCC_PLL2CFGR_PLL2SRC_CSI       ((uint32_t)0x00000002)  /* CSI source clock selected */
# define RCC_PLL2CFGR_PLL2SRC_HSE       ((uint32_t)0x00000003)  /* HSE source clock selected */

#define RCC_PLL2CFGR_PLL2RGE_SHIFT       (2ul)
#define RCC_PLL2CFGR_PLL2RGE_MASK        (0x3ul << RCC_PLL2CFGR_PLL2RGE_SHIFT)
#define RCC_PLL2CFGR_PLL2RGE             RCC_PLL2CFGR_PLL2RGE_MASK
# define RCC_PLL2CFGR_PLL2RGE_1_2_MHZ    (0x0ul << RCC_PLL2CFGR_PLL2RGE_SHIFT)  /* The PLL input clock range frequency is between 1 and 2 MHz */
# define RCC_PLL2CFGR_PLL2RGE_2_4_MHZ    (0x1ul << RCC_PLL2CFGR_PLL2RGE_SHIFT)  /* The PLL input clock range frequency is between 2 and 4 MHz */
# define RCC_PLL2CFGR_PLL2RGE_4_8_MHZ    (0x2ul << RCC_PLL2CFGR_PLL2RGE_SHIFT)  /* The PLL input clock range frequency is between 4 and 8 MHz */
# define RCC_PLL2CFGR_PLL2RGE_8_16_MHZ   (0x3ul << RCC_PLL2CFGR_PLL2RGE_SHIFT)  /* The PLL input clock range frequency is between 8 and 16 MHz */

#define RCC_PLL2CFGR_PLL2FRACEN          (1 << 4) /* Fractional latch enable */
#define RCC_PLL2CFGR_PLL2VCOSEL          (1 << 5)

#define RCC_PLL2CFGR_PLL2M_SHIFT       (8ul)
#define RCC_PLL2CFGR_PLL2M_MASK        (0x3Ful << RCC_PLL2CFGR_PLL2M_SHIFT)
#define RCC_PLL2CFGR_PLL2M             RCC_PLL2CFGR_PLL2M_MASK

#define RCC_PLL2CFGR_PLL2PEN           (1 << 16)
#define RCC_PLL2CFGR_PLL2QEN           (1 << 17)
#define RCC_PLL2CFGR_PLL2REN           (1 << 18)



/*  Bit definition for RCCPLL3CFGR register */

/* #define RCCPLL3CFGR_RESET               ((uint32_t)0x01FF0000) */

#define RCC_PLL3CFGR_PLL3SRC_SHIFT      (0)  /* Bit 0: */
#define RCC_PLL3CFGR_PLL3SRC_MASK       (0x3 << RCC_PLL3CFGR_PLL3SRC_SHIFT)
#define RCC_PLL3CFGR_PLL3SRC            RCC_PLL3CFGR_PLL3SRC_MASK
# define RCC_PLL3CFGR_PLL3SRC_NONE      ((uint32_t)0x00000000)  /* No source clock selected */
# define RCC_PLL3CFGR_PLL3SRC_HSI       ((uint32_t)0x00000001)  /* HSI source clock selected */
# define RCC_PLL3CFGR_PLL3SRC_CSI       ((uint32_t)0x00000002)  /* CSI source clock selected */
# define RCC_PLL3CFGR_PLL3SRC_HSE       ((uint32_t)0x00000003)  /* HSE source clock selected */

#define RCC_PLL3CFGR_PLL3RGE_SHIFT       (2ul)
#define RCC_PLL3CFGR_PLL3RGE_MASK        (0x3ul << RCC_PLL3CFGR_PLL3RGE_SHIFT)
#define RCC_PLL3CFGR_PLL3RGE             RCC_PLL3CFGR_PLL3RGE_MASK
# define RCC_PLL3CFGR_PLL3RGE_1_2_MHZ    (0x0ul << RCC_PLL3CFGR_PLL3RGE_SHIFT)  /* The PLL input clock range frequency is between 1 and 2 MHz */
# define RCC_PLL3CFGR_PLL3RGE_2_4_MHZ    (0x1ul << RCC_PLL3CFGR_PLL3RGE_SHIFT)  /* The PLL input clock range frequency is between 2 and 4 MHz */
# define RCC_PLL3CFGR_PLL3RGE_4_8_MHZ    (0x2ul << RCC_PLL3CFGR_PLL3RGE_SHIFT)  /* The PLL input clock range frequency is between 4 and 8 MHz */
# define RCC_PLL3CFGR_PLL3RGE_8_16_MHZ   (0x3ul << RCC_PLL3CFGR_PLL3RGE_SHIFT)  /* The PLL input clock range frequency is between 8 and 16 MHz */

#define RCC_PLL3CFGR_PLL3FRACEN          (1 << 4) /* Fractional latch enable */
#define RCC_PLL3CFGR_PLL3VCOSEL          (1 << 5)

#define RCC_PLL3CFGR_PLL3M_SHIFT       (8ul)
#define RCC_PLL3CFGR_PLL3M_MASK        (0x3Ful << RCC_PLL3CFGR_PLL3M_SHIFT)
#define RCC_PLL3CFGR_PLL3M             RCC_PLL3CFGR_PLL3M_MASK

