JaeheeKwon/nuttx/arch/arm/src/stm32h5/hardware/stm32h5x3xx_rcc.h
/* APB1 peripheral low reset register */

#define RCC_APB1LRSTR_TIM2RST           (1 << 0)  /* RCC APB1LRSTR: TIM2RST */
#define RCC_APB1LRSTR_TIM3RST           (1 << 1)  /* RCC APB1LRSTR: TIM3RST */
#define RCC_APB1LRSTR_TIM4RST           (1 << 2)  /* RCC APB1LRSTR: TIM4RST */
#define RCC_APB1LRSTR_TIM5RST           (1 << 3)  /* RCC APB1LRSTR: TIM5RST */
#define RCC_APB1LRSTR_TIM6RST           (1 << 4)  /* RCC APB1LRSTR: TIM6RST */
#define RCC_APB1LRSTR_TIM7RST           (1 << 5)  /* RCC APB1LRSTR: TIM7RST */
#define RCC_APB1LRSTR_TIM12RST          (1 << 6)  /* RCC APB1LRSTR: TIM12RST */
#define RCC_APB1LRSTR_TIM13RST          (1 << 7)  /* RCC APB1LRSTR: TIM13RST */
#define RCC_APB1LRSTR_TIM14RST          (1 << 8)  /* RCC APB1LRSTR: TIM14RST */
#define RCC_APB1LRSTR_SPI2RST           (1 << 14) /* RCC APB1LRSTR: SPI2RST */
#define RCC_APB1LRSTR_SPI3RST           (1 << 15) /* RCC APB1LRSTR: SPI3RST */
#define RCC_APB1LRSTR_USART2RST         (1 << 17) /* RCC APB1LRSTR: USART2RST */
#define RCC_APB1LRSTR_USART3RST         (1 << 18) /* RCC APB1LRSTR: USART3RST */
#define RCC_APB1LRSTR_UART4RST          (1 << 19) /* RCC APB1LRSTR: UART4RST */
#define RCC_APB1LRSTR_UART5RST          (1 << 20) /* RCC APB1LRSTR: UART5RST */
#define RCC_APB1LRSTR_I2C1RST           (1 << 21) /* RCC APB1LRSTR: I2C1RST */
#define RCC_APB1LRSTR_I2C2RST           (1 << 22) /* RCC APB1LRSTR: I2C2RST */
#define RCC_APB1LRSTR_I3C1RST           (1 << 23) /* RCC APB1LRSTR: I3C1RST */
#define RCC_APB1LRSTR_CRSRST            (1 << 24) /* RCC APB1LRSTR: CRSRST */
#define RCC_APB1LRSTR_UART6RST          (1 << 25) /* RCC APB1LRSTR: UART6RST */
#define RCC_APB1LRSTR_UART10RST         (1 << 26) /* RCC APB1LRSTR: UART10RST */
#define RCC_APB1LRSTR_UART11RST         (1 << 27) /* RCC APB1LRSTR: UART11RST */
#define RCC_APB1LRSTR_CECRST            (1 << 28) /* RCC APB1LRSTR: CECRST */
#define RCC_APB1LRSTR_USART7RST         (1 << 30) /* RCC APB1LRSTR: USART7RST */
#define RCC_APB1LRSTR_USART8RST         (1 << 31) /* RCC APB1LRSTR: USART8RST */


/* APB1 peripheral high reset register */

#define RCC_APB1HRSTR_UART9RST          (1 << 0)  /* RCC APB1HRSTR: UART9RST */
#define RCC_APB1HRSTR_UART12RST         (1 << 1)  /* RCC APB1HRSTR: UART12RST */
#define RCC_APB1HRSTR_DTSRST            (1 << 3)  /* RCC APB1HRSTR: DTSRST */
#define RCC_APB1HRSTR_LPTIM2RST         (1 << 5)  /* RCC APB1HRSTR: LPTIM2RST */
#define RCC_APB1HRSTR_FDCANRST          (1 << 9)  /* RCC APB1HRSTR: FDCANRST*/
#define RCC_APB1HRSTR_UCPD1RST          (1 << 23) /* RCC APB1HRSTR: UCPD1RST*/


/* APB2 peripheral reset register */

#define RCC_APB2RSTR_TIM1RST            (1 << 11)  /* RCC APB2RSTR: TIM1RST */
#define RCC_APB2RSTR_SPI1RST            (1 << 12)  /* RCC APB2RSTR: SPI1RST */
#define RCC_APB2RSTR_TIM8RST            (1 << 13)  /* RCC APB2RSTR: TIM8RST */
#define RCC_APB2RSTR_USART1RST          (1 << 14)  /* RCC APB2RSTR: USART1RST */
#define RCC_APB2RSTR_TIM15RST           (1 << 16) /* RCC APB2RSTR: TIM15RST */
#define RCC_APB2RSTR_TIM16RST           (1 << 17) /* RCC APB2RSTR: TIM16RST */
#define RCC_APB2RSTR_TIM17RST           (1 << 18) /* RCC APB2RSTR: TIM17RST */
#define RCC_APB2RSTR_SPI4RST            (1 << 19) /* RCC APB2RSTR: SPI4RST */
#define RCC_APB2RSTR_SPI6RST            (1 << 20) /* RCC APB2RSTR: SPI6RST */
#define RCC_APB2RSTR_SAI1RST            (1 << 21) /* RCC APB2RSTR: SAI1RST */
#define RCC_APB2RSTR_SAI2RST            (1 << 22) /* RCC APB2RSTR: SAI2RST */
#define RCC_APB2RSTR_USBRST             (1 << 24) /* RCC APB2RSTR: USBRST */


/* APB3 peripheral reset register */

#define RCC_APB3RSTR_SPI5RST            (1 << 5) /* RCC APB3RSTR: SPI5RST */
#define RCC_APB3RSTR_LPUART1RST         (1 << 6) /* RCC APB3RSTR: LPUART1RST */
#define RCC_APB3RSTR_I2C3RST            (1 << 7) /* RCC APB3RSTR: I2C3RST */
#define RCC_APB3RSTR_I2C4RST            (1 << 8) /* RCC APB3RSTR: I2C4RST */
#define RCC_APB3RSTR_LPTIM1RST          (1 << 11) /* RCC APB3RSTR: LPTIM1RST */
#define RCC_APB3RSTR_LPTIM3RST          (1 << 12) /* RCC APB3RSTR: LPTIM3RST */
#define RCC_APB3RSTR_LPTIM4RST          (1 << 13) /* RCC APB3RSTR: LPTIM4RST */
#define RCC_APB3RSTR_LPTIM5RST          (1 << 14) /* RCC APB3RSTR: LPTIM5RST */
#define RCC_APB3RSTR_LPTIM6RST          (1 << 15) /* RCC APB3RSTR: LPTIM6RST */
#define RCC_APB3RSTR_VREFRST            (1 << 20) /* RCC APB3RSTR: VREFRST */

/* AHB1 Peripheral Clock enable register */

#define RCC_AHB1ENR_GDMA1EN             (1 << 0)  /* RCC AHB1ENR: GDMA1EN */
#define RCC_AHB1ENR_GDMA2EN             (1 << 1)  /* RCC AHB1ENR: GDMA2EN */
#define RCC_AHB1ENR_FLITFEN             (1 << 8)  /* RCC AHB1ENR: FLITFEN */
#define RCC_AHB1ENR_CRCEN               (1 << 12) /* RCC AHB1ENR: CRCEN */
#define RCC_AHB1ENR_CORDICEN            (1 << 14) /* RCC AHB1ENR: CORDICEN */
#define RCC_AHB1ENR_FMACEN              (1 << 15) /* RCC AHB1ENR: FMACEN */
#define RCC_AHB1ENR_RAMCFGEN            (1 << 17) /* RCC AHB1ENR: RAMCFGEN */
#define RCC_AHB1ENR_ETHMACEN            (1 << 19) /* RCC AHB1ENR: ETHMACEN */
#define RCC_AHB1ENR_ETHTXEN             (1 << 20) /* RCC AHB1ENR: ETHTXEN */
#define RCC_AHB1ENR_ETHRXEN             (1 << 21) /* RCC AHB1ENR: ETHRXEN */
#define RCC_AHB1ENR_TZSC1EN             (1 << 24) /* RCC AHB1ENR: TZSC1EN */
#define RCC_AHB1ENR_BKPRAMEN            (1 << 28) /* RCC AHB1ENR: BKPRAMEN */
#define RCC_AHB1ENR_DCACHEEN            (1 << 30) /* RCC AHB1ENR: DCACHEEN */
#define RCC_AHB1ENR_SRAM1EN             (1 << 31) /* RCC AHB1ENR: SRAM1EN */

/* AHB2 Peripheral Clock enable register */

#define RCC_AHB2ENR_GPIOAEN             (1 << 0)  /* RCC AHB2ENR: GPIOAEN */
#define RCC_AHB2ENR_GPIOBEN             (1 << 1)  /* RCC AHB2ENR: GPIOBEN */
#define RCC_AHB2ENR_GPIOCEN             (1 << 2)  /* RCC AHB2ENR: GPIOCEN */
#define RCC_AHB2ENR_GPIODEN             (1 << 3)  /* RCC AHB2ENR: GPIODEN */
#define RCC_AHB2ENR_GPIOEEN             (1 << 4)  /* RCC AHB2ENR: GPIOEEN */
#define RCC_AHB2ENR_GPIOFEN             (1 << 5)  /* RCC AHB2ENR: GPIOFEN */
#define RCC_AHB2ENR_GPIOGEN             (1 << 6)  /* RCC AHB2ENR: GPIOGEN */
#define RCC_AHB2ENR_GPIOHEN             (1 << 7)  /* RCC AHB2ENR: GPIOHEN */
#define RCC_AHB2ENR_GPIOIEN             (1 << 8)  /* RCC AHB2ENR: GPIOIEN */
#define RCC_AHB2ENR_ADCEN               (1 << 10) /* RCC AHB2ENR: ADCEN */
#define RCC_AHB2ENR_DAC1EN              (1 << 11) /* RCC AHB2ENR: DAC1EN */
#define RCC_AHB2ENR_DCMIPSSIEN          (1 << 12) /* RCC AHB2ENR: DCMIPSSIEN */
#define RCC_AHB2ENR_AESMEN              (1 << 16) /* RCC AHB2ENR: AESEN */
#define RCC_AHB2ENR_HASHEN              (1 << 17) /* RCC AHB2ENR: HASHEN */
#define RCC_AHB2ENR_RNGEN               (1 << 18) /* RCC AHB2ENR: RNGEN */
#define RCC_AHB2ENR_PKAEN               (1 << 19) /* RCC AHB2ENR: PKAEN */
#define RCC_AHB2ENR_SAESEN              (1 << 20) /* RCC AHB2ENR: SAESEN */
#define RCC_AHB2ENR_SRAM2EN             (1 << 30) /* RCC AHB2ENR: SRAM2EN */
#define RCC_AHB2ENR_SRAM3EN             (1 << 31) /* RCC AHB2ENR: SRAM3EN */

/* AHB4 Peripheral Clock enable register */

