JaeheeKwon/nuttx/arch/arm/src/stm32h5/hardware/stm32h5x3xx_rcc.h
#define RCC_AHB4ENR_OTFDEC1EN           (1 << 0)  /* RCC AHB4ENR: OTFDEC1EN */
#define RCC_AHB4ENR_SDMMC1EN            (1 << 11) /* RCC AHB4ENR: SDMMC1EN */
#define RCC_AHB4ENR_SDMMC2EN            (1 << 12) /* RCC AHB4ENR: SDMMC1EN */
#define RCC_AHB4ENR_FMCEN               (1 << 16) /* RCC AHB4ENR: FMCEN */
#define RCC_AHB4ENR_OCTOSPI1EN          (1 << 20) /* RCC AHB4ENR: OCTOSPI1EN */


/* APB1 L Peripheral Clock enable register */

#define RCC_APB1LENR_TIM2EN             (1 << 0)  /* RCC APB1LENR: TIM2EN */
#define RCC_APB1LENR_TIM3EN             (1 << 1)  /* RCC APB1LENR: TIM3EN */
#define RCC_APB1LENR_TIM4EN             (1 << 2)  /* RCC APB1LENR: TIM4EN */
#define RCC_APB1LENR_TIM5EN             (1 << 3)  /* RCC APB1LENR: TIM5EN */
#define RCC_APB1LENR_TIM6EN             (1 << 4)  /* RCC APB1LENR: TIM6EN */
#define RCC_APB1LENR_TIM7EN             (1 << 5)  /* RCC APB1LENR: TIM7EN */
#define RCC_APB1LENR_TIM12EN            (1 << 6)  /* RCC APB1LENR: TIM12EN */
#define RCC_APB1LENR_TIM13EN            (1 << 7)  /* RCC APB1LENR: TIM13EN */
#define RCC_APB1LENR_TIM14EN            (1 << 8)  /* RCC APB1LENR: TIM14EN */
#define RCC_APB1LENR_WWDGEN             (1 << 11) /* RCC APB1LENR: WWDGEN */
#define RCC_APB1LENR_SPI2EN             (1 << 14) /* RCC APB1LENR: SPI2EN */
#define RCC_APB1LENR_SPI3EN             (1 << 15) /* RCC APB1LENR: SPI3EN */
#define RCC_APB1LENR_USART2EN           (1 << 17) /* RCC APB1LENR: USART2EN */
#define RCC_APB1LENR_USART3EN           (1 << 18) /* RCC APB1LENR: USART3EN */
#define RCC_APB1LENR_UART4EN            (1 << 19) /* RCC APB1LENR: UART4EN */
#define RCC_APB1LENR_UART5EN            (1 << 20) /* RCC APB1LENR: UART5EN */
#define RCC_APB1LENR_I2C1EN             (1 << 21) /* RCC APB1LENR: I2C1EN */
#define RCC_APB1LENR_I2C2EN             (1 << 22) /* RCC APB1LENR: I2C2EN */
#define RCC_APB1LENR_I3C1EN             (1 << 23) /* RCC APB1LENR: I3C1EN */
#define RCC_APB1LENR_CRSEN              (1 << 24) /* RCC APB1LENR: CRSEN */
#define RCC_APB1LENR_USART6EN           (1 << 25) /* RCC APB1LENR: USART6EN */
#define RCC_APB1LENR_USART10EN          (1 << 26) /* RCC APB1LENR: USART10EN */
#define RCC_APB1LENR_USART11EN          (1 << 27) /* RCC APB1LENR: USART11EN */
#define RCC_APB1LENR_CECEN              (1 << 28) /* RCC APB1LENR: CECEN */
#define RCC_APB1LENR_UART7EN            (1 << 30) /* RCC APB1LENR: UART7EN */
#define RCC_APB1LENR_UART8EN            (1 << 31) /* RCC APB1LENR: UART8EN */


/* APB1 H Peripheral Clock enable register */

#define RCC_APB1HENR_UART9EN            (1 << 0) /* RCC APB1HENR: UART9EN */
#define RCC_APB1HENR_UART12EN           (1 << 1) /* RCC APB1HENR: UART12EN */
#define RCC_APB1HENR_DTSEN              (1 << 3) /* RCC APB1HENR: DTSEN */
#define RCC_APB1HENR_LPTIM2EN           (1 << 5) /* RCC APB1HENR: LPTIM2EN */
#define RCC_APB1HENR_FDCANEN            (1 << 9) /* RCC APB1HENR: FDCANEN */
#define RCC_APB1HENR_UCPD1EN            (1 << 23)/* RCC APB1HENR: UCPD1EN */


/* APB2 Peripheral Clock enable register */

#define RCC_APB2ENR_TIM1EN              (1 << 11) /* Bit 11: RCC APB2ENR: TIM1EN */
#define RCC_APB2ENR_SPI1EN              (1 << 12) /* Bit 12: RCC APB2ENR: SPI1EN */
#define RCC_APB2ENR_TIM8EN              (1 << 13) /* Bit 13: RCC APB2ENR: TIM8EN  */
#define RCC_APB2ENR_USART1EN            (1 << 14) /* Bit 14: RCC APB2ENR: USART1EN */
#define RCC_APB2ENR_TIM15EN             (1 << 16) /* Bit 16: RCC APB2ENR: TIM15EN */
#define RCC_APB2ENR_TIM16EN             (1 << 17) /* Bit 17: RCC APB2ENR: TIM16EN */
#define RCC_APB2ENR_TIM17EN             (1 << 18) /* Bit 18: RCC APB2ENR: TIM17EN  */
#define RCC_APB2ENR_SPI4EN              (1 << 19) /* Bit 19: RCC APB2ENR: SPI4EN */
#define RCC_APB2ENR_SPI6EN              (1 << 20) /* Bit 20: RCC APB2ENR: SPI6EN */
#define RCC_APB2ENR_SAI1EN              (1 << 21) /* Bit 21: RCC APB2ENR: SAI1EN */
#define RCC_APB2ENR_SAI2EN              (1 << 22) /* Bit 22: RCC APB2ENR: SAI2EN */
#define RCC_APB2ENR_USBEN               (1 << 24) /* Bit 24: RCC APB2ENR: USBEN */


/* APB3 Peripheral Clock enable register */

#define RCC_APB3ENR_SBSEN               (1 << 1)  /* RCC APB3ENR: SBSEN */
#define RCC_APB3ENR_SPI5EN              (1 << 5)  /* RCC APB3ENR: SPI5EN */
#define RCC_APB3ENR_LPUART1EN           (1 << 6)  /* RCC APB3ENR: LPUART1EN */
#define RCC_APB3ENR_I2C3EN              (1 << 7)  /* RCC APB3ENR: I2C3EN */
#define RCC_APB3ENR_I2C4EN              (1 << 8)  /* RCC APB3ENR: I2C4EN */
#define RCC_APB3ENR_LPTIM1EN            (1 << 11) /* RCC APB3ENR: LPTIM1EN */
#define RCC_APB3ENR_LPTIM3EN            (1 << 12) /* RCC APB3ENR: LPTIM3EN */
#define RCC_APB3ENR_LPTIM4EN            (1 << 13) /* RCC APB3ENR: LPTIM4EN */
#define RCC_APB3ENR_LPTIM5EN            (1 << 14) /* RCC APB3ENR: LPTIM5EN */
#define RCC_APB3ENR_LPTIM6EN            (1 << 15) /* RCC APB3ENR: LPTIM6EN */
#define RCC_APB3ENR_VREFBUFEN           (1 << 20) /* RCC APB3ENR: VREFBUFEN */
#define RCC_APB3ENR_RTCAPBEN            (1 << 21) /* RCC APB3ENR: RTCAPBEN */


//TODO Low power not supported yet.
/* AHB3 low power mode peripheral clock enable register */

#define RCC_AHB3LPENR_MDMALPEN          (1 << 0)  /* RCC AHB3LPENR: MDMALPEN */
#define RCC_AHB3LPENR_DMA2DLPEN         (1 << 4)  /* RCC AHB3LPENR: DMA2DLPEN */
#define RCC_AHB3LPENR_JPGDECLPEN        (1 << 5)  /* RCC AHB3LPENR: JPGDECLPEN */
#define RCC_AHB3LPENR_FLITFLPEN         (1 << 8)  /* RCC AHB3LPENR: FLITFLPEN */
#define RCC_AHB3LPENR_FMCLPEN           (1 << 12) /* RCC AHB3LPENR: FMCLPEN */
#define RCC_AHB3LPENR_QSPILPEN          (1 << 14) /* RCC AHB3LPENR: QSPILPEN */
#define RCC_AHB3LPENR_SDMMC1LPEN        (1 << 16) /* RCC AHB3LPENR: SDMMC1LPEN */
#define RCC_AHB3LPENR_D1DTCM1LPEN       (1 << 28) /* RCC AHB3LPENR: D1DTCM1LPEN */
#define RCC_AHB3LPENR_DTCM2LPEN         (1 << 29) /* RCC AHB3LPENR: DTCM2LPEN */
#define RCC_AHB3LPENR_ITCMLPEN          (1 << 30) /* RCC AHB3LPENR: ITCMLPEN */
#define RCC_AHB3LPENR_AXISRAMLPEN       (1 << 31) /* RCC AHB3LPENR: AXISRAMLPEN */

/* AHB1 low power mode peripheral clock enable register */

#define RCC_AHB1LPENR_DMA1LPEN          (1 << 0)  /* RCC AHB1LPENR: DMA1LPEN */
#define RCC_AHB1LPENR_DMA2LPEN          (1 << 1)  /* RCC AHB1LPENR: DMA2LPEN */
#define RCC_AHB1LPENR_ADC12LPEN         (1 << 5)  /* RCC AHB1LPENR: ADC12LPEN */
#define RCC_AHB1LPENR_ETH1MACLPEN       (1 << 15) /* RCC AHB1LPENR: ETH1MACLPEN */
#define RCC_AHB1LPENR_ETH1TXLPEN        (1 << 16) /* RCC AHB1LPENR: ETH1TXLPEN */
#define RCC_AHB1LPENR_ETH1RXLPEN        (1 << 17) /* RCC AHB1LPENR: ETH1RXLPEN */
#define RCC_AHB1LPENR_OTGHSLPEN         (1 << 25) /* RCC AHB1LPENR: OTGHSLPEN */
#define RCC_AHB1LPENR_OTGHSULPILPEN     (1 << 26) /* RCC AHB1LPENR: OTGHSULPILPEN */
#define RCC_AHB1LPENR_OTGFSLPEN         (1 << 27) /* RCC AHB1LPENR: OTGFSLPEN */

